{
  "extends": "../../tslint.json",
  "rules": {
    "directive-selector": [true, "attribute", "hda", "camelCase"],
    "component-selector": [true, "element", "hda", "kebab-case"],
    "completed-docs": false,
    "ban-types": {
      "options": [
        ["Object", "Avoid using the `Object` type. Did you mean `object`?"],
        ["Function", "Avoid using the `Function` type. Prefer a specific function type, like `() => void`."],
        ["Boolean", "Avoid using the `Boolean` type. Did you mean `boolean`?"],
        ["Number", "Avoid using the `Number` type. Did you mean `number`?"],
        ["String", "Avoid using the `String` type. Did you mean `string`?"],
        ["Symbol", "Avoid using the `Symbol` type. Did you mean `symbol`?"],
        ["ArrayDeserializer", "Please use the Angular injectable version instead: ArrayDeserializerService"],
        ["DeserializationManager", "Please use the Angular injectable version instead: DeserializationManagerService"],
        ["ModelDeserializer", "Please use the Angular injectable version instead: ModelDeserializerService"],
        ["ModelLibrary", "Please use the Angular injectable version instead: ModelLibraryService"],
        ["ModelManager", "Please use the Angular injectable version instead: ModelManagerService"],
        ["ObjectDeserializer", "Please use the Angular injectable version instead: ObjectDeserializerService"],
        ["PrimitiveDeserializer", "Please use the Angular injectable version instead: PrimitiveDeserializerService"],
        ["RendererLibrary", "Please use the Angular injectable version instead: RendererLibraryService"],
        ["DashboardManager", "Please use the Angular injectable version instead: DashboardManagerService"],
        ["Logger", "Please use the Angular injectable version instead: LoggerService"],
        ["DataSourceManager", "Please use the Angular injectable version instead: DataSourceManagerService"],
        [
          "ModelPropertyTypeLibrary",
          "Please use the Angular injectable version instead: ModelPropertyTypeLibraryService"
        ],
        ["VariableManager", "Please use the Angular injectable version instead: VariableManagerService"],
        ["VariableDeserializer", "Please use the Angular injectable version instead: VariableDeserializerService"],
        ["DashboardEventManager", "Please use the Angular injectable version instead: DashboardEventManagerService"],
        ["ModelCreatedEvent", "Please use the Angular injectable version instead: ModelCreatedEventService"],
        ["ModelDestroyedEvent", "Please use the Angular injectable version instead: ModelDestroyedEventService"],
        ["ModelPropertyValidator", "Please use the Angular injectable version instead: ModelPropertyValidatorService"],
        ["DefaultModelApiBuilder", "Please use the Angular injectable version instead: DefaultModelApiBuilderService"],
        ["ModelChangedEvent", "Please use the Angular injectable version instead: ModelChangedEventService"],
        ["ThemeManager", "Please use the Angular injectable version instead: ThemeManagerService"],
        ["ModelEventInstaller", "Please use the Angular injectable version instead: ModelEventInstallerService"],
        ["ArraySerializer", "Please use the Angular injectable version instead: ArraySerializerService"],
        ["SerializationManager", "Please use the Angular injectable version instead: SerializationManagerService"],
        ["ModelSerializer", "Please use the Angular injectable version instead: ModelSerializerService"],
        ["VariableSerializer", "Please use the Angular injectable version instead: VariableSerializerService"],
        ["ObjectSerializer", "Please use the Angular injectable version instead: ObjectSerializerService"],
        ["PrimitiveSerializer", "Please use the Angular injectable version instead: PrimitiveSerializerService"],
        ["EditorLibary", "Please use the Angular injectable version instead: EditorLibaryService"],
        ["EditorApiFactory", "Please use the Angular injectable version instead: EditorApiFactoryService"],
        ["ModelPropertyType", "Please use the Angular injectable version instead: ModelPropertyTypeService"],
        ["DataRefreshEvent", "Please use the Angular injectable version instead: DataRefreshEventService"],
        ["TimeRangeChangedEvent", "Please use the Angular injectable version instead: TimeRangeChangedEventService"],
        ["TimeRangeManager", "Please use the Angular injectable version instead: TimeRangeManagerService"]
      ]
    }
  }
}
